import java.util.Scanner;
public class Trial1  {
    public static void main(String[] args) {
        String[] category1 = {"Φόρος εισοδήματος φυσικών προσώπων", "Φόρος εισοδήματος νομικών προσώπων", "Φόρος προστιθέμενης αξίας", "Ειδικός φόρος κατανάλωσης καυσίμων", "Ειδικός φόρος κατανάλωσης καπνού", "Ειδικός φόρος κατανάλωσης αλκοόλ", "Φόρος ακίνητης περιουσίας", "Τέλη κυκλοφορίας", "Τεκμήρια/έμμεσοι φόροι περιουσίας", "Τέλη χαρτοσήμου", "Έσοδα από κρατικές υπηρεσίες", "Πρόστιμα και κυρώσεις", "Έσοδα από παραχωρήσεις/άδειες", "Έσοδα από αποκρατικοποιήσεις", "Έσοδα από αξιοποίηση δημόσιας περιουσίας", "Ανταποδοτικά τέλη ΟΤΑ", "Κέρδη από δημόσιες επιχειρήσεις", "Τόκοι από διαθέσιμα του Δημοσίου", "Ευρωπαϊκά κονδύλια / ΕΣΠΑ" , "Δάνεια και χρηματοδοτήσεις από διεθνείς οργανισμούς"};
        int[] values1 = new int[20];
        Trial.budgetItem(category1, values1);
        String[] cat2 = {"a", "b"};
        int[] val2 = new int[2];
        Trial.budgetItem(cat2, val2);

        Scanner sc = new Scanner(System.in);

        do { 
            System.out.println("\n--- Σύστημα Προϋπολογισμού ---");
            System.out.println("1. Εμφάνιση Στοιχείων Προϋπολογισμού");
            System.out.println("2. Eισαγωγή αλλαγών στα ήδη υπάρχοντα στοιχεία");
            System.out.println("0. Έξοδος");
            int choise = sc.nextInt();

            switch () {
                case :
                    
                    break;
                default:
                    throw new AssertionError();
            }
        
    }
}
